_wiki/2015-08-07-restore-lost-files.html
---
collections: wiki
layout: post
title: Restore Lost Files
date: 2015-08-07
categories: 
-
tags: 
- testdisk
- recovery
- disk
author: carltonf
excerpt: 
---
<p>
Tools I've used to restore deleted/overwritten files.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><code>testdisk</code></h2>
<div class="outline-text-2" id="text-1">
<p>
This is a tool mainly for partition fixing, but the built-in file restoring
function has come to handy a lot of times.
</p>

<p>
Particularly good for case: you know the position of the file and there is no
same-named file under the same path (i.e. doesn't work for overwritten files).
This tool recovers the file by looking at the file system journal.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><code>photorec</code></h2>
<div class="outline-text-2" id="text-2">
<p>
The more powerful tool coming from the same developer team. This tool bypasses
the file system, recovers files by looking at the content instead. This is the
best shot for overwritten files.
</p>

<p>
<b>NOTE</b>: Many on web says that you can't recover overwritten files. The fact is
if the blocks of the files are overwritten then you are out of luck, but usually
overwriting leaves the old one intact by storing new content in new blocks.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Other "bizarre" ways</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>grep</code>, <code>debugfs</code> and blablabla&#x2026;. They work by principle and look awesome, BUT
it's hard to use them.
</p>
</div>
</div>
